#+BEGIN_COMMENT
.. title: Deep N-Grams: Generating Sentences
.. slug: deep-n-grams-generating-sentences
.. date: 2021-01-05 16:49:26 UTC-08:00
.. tags: nlp,n-grams,rnn,gru
.. category: NLP
.. link: 
.. description: Generating sentences with our GRU model.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-b5d72b74-c138-4af9-867f-c0dd39175ef3-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

** Some Predictions
#+begin_src python :results output :exports both
print(predict(32, ""))
#+end_src   

#+RESULTS:
: you would not live at essenomed 

Yes, but I don't know anyone who would. Note that we are using a random sample, so repeatedly making predictions won't necessarily get you the same result.
#+begin_src python :results output :exports both
print(predict(32, ""))
print(predict(32, ""))
print(predict(32, ""))
#+end_src

#+RESULTS:
: [exeunt]
: katharine	yes, you are like the 
: le beau	where's some of my prett

#+begin_src python :results output :exports both
print(predict(64, "falstaff"))
#+end_src

#+RESULTS:
: falstaff	yea, marry, lady, she hath bianced three months.

/bianced/?

#+begin_src python :results output :exports both
print(predict(64, "beast"))
#+end_src

#+RESULTS:
: beastly, and god forbid, sir! our revenue's cannon,

#+begin_src python :results output :exports both
start = "finger"
for word in range(5):
    start = predict(10, start)
    print(start)
#+end_src

#+RESULTS:
: finger, iago, an
: finger, iago, and ask.
: finger, iago, and ask.
: finger, iago, and ask.
: finger, iago, and ask.

So, if you feed it enough text, it becomes more deterministic.

#+begin_src python :results output :exports both
SPACE = ord(" ")
start = "iago"
output = start
for word in range(10):
    tokens = predict(32, start).split()
    start = tokens[1] if len(tokens) > 1 else tokens[0]
    output = f"{output} {start}"
print(output)    
#+end_src

#+RESULTS:
: iago your husband if there never for you need no never


In the generated text above, you can see that the model generates text that makes sense capturing dependencies between words and without any input. A simple n-gram model would have not been able to capture all of that in one sentence.
